In [ ]:
# Oh maybe we could just pick out each of the samples from each of them and use that...Then also extend to the other datasets.

# So yeah - let's feed ChatGPT and see what scripts it could generate for me

In [3]:
import json

# Step 1: Read both JSON files and load the data into memory
with open('../spider/dev.json') as f:
    spiderDataPoints = json.load(f)

with open('../sql_create_context_v4.json') as f:
    sqlCreateContextPoints = json.load(f)

In [4]:
print(len(spiderDataPoints))

1034

In [5]:
import sqlparse

def normalize_query(query):
    # Lowercase the query
    query = query.lower()
    
    # Parse and format the query to normalize the spacing
    parsed_query = sqlparse.parse(query)
    normalized_query = " ".join([sqlparse.format(str(stmt), strip_comments=True, strip_whitespace=True) for stmt in parsed_query])
    
    return normalized_query

# Test the function
query = "SELECT count(*) FROM pets WHERE weight  >  10"
normalized_query = normalize_query(query)
print(normalized_query)

select count(*) from pets where weight > 10

In [6]:
for createContextItem in sqlCreateContextPoints:
    if "answer" in createContextItem:
        # print(item1["answer"])
        createContextItem["normalised"] = normalize_query(createContextItem["answer"])

for spiderItem in spiderDataPoints:
    if "query" in spiderItem:
        # print(item2["query"])
        spiderItem["normalised"] = normalize_query(spiderItem["query"])

In [7]:
sqlCreateContextPoints

[{'question': 'How many heads of the departments are older than 56 ?',
  'context': 'CREATE TABLE head (age INTEGER)',
  'answer': 'SELECT COUNT(*) FROM head WHERE age > 56',
  'normalised': 'select count(*) from head where age > 56'},
 {'question': 'List the name, born state and age of the heads of departments ordered by age.',
  'context': 'CREATE TABLE head (name VARCHAR, born_state VARCHAR, age VARCHAR)',
  'answer': 'SELECT name, born_state, age FROM head ORDER BY age',
  'normalised': 'select name, born_state, age from head order by age'},
 {'question': 'List the creation year, name and budget of each department.',
  'context': 'CREATE TABLE department (creation VARCHAR, name VARCHAR, budget_in_billions VARCHAR)',
  'answer': 'SELECT creation, name, budget_in_billions FROM department',
  'normalised': 'select creation, name, budget_in_billions from department'},
 {'question': 'What are the maximum and minimum budget of the departments?',
  'context': 'CREATE TABLE department (budget_in_billions INTEGER)',
  'answer': 'SELECT MAX(budget_in_billions), MIN(budget_in_billions) FROM department',
  'normalised': 'select max(budget_in_billions), min(budget_in_billions) from department'},
 {'question': 'What is the average number of employees of the departments whose rank is between 10 and 15?',
  'context': 'CREATE TABLE department (num_employees INTEGER, ranking INTEGER)',
  'answer': 'SELECT AVG(num_employees) FROM department WHERE ranking BETWEEN 10 AND 15',
  'normalised': 'select avg(num_employees) from department where ranking between 10 and 15'},
 {'question': 'What are the names of the heads who are born outside the California state?',
  'context': 'CREATE TABLE head (name VARCHAR, born_state VARCHAR)',
  'answer': "SELECT name FROM head WHERE born_state <> 'California'",
  'normalised': "select name from head where born_state <> 'california'"},
 {'question': "What are the distinct creation years of the departments managed by a secretary born in state 'Alabama'?",
  'context': 'CREATE TABLE department (creation VARCHAR, department_id VARCHAR); CREATE TABLE management (department_id VARCHAR, head_id VARCHAR); CREATE TABLE head (head_id VARCHAR, born_state VARCHAR)',
  'answer': "SELECT DISTINCT T1.creation FROM department AS T1 JOIN management AS T2 ON T1.department_id = T2.department_id JOIN head AS T3 ON T2.head_id = T3.head_id WHERE T3.born_state = 'Alabama'",
  'normalised': "select distinct t1.creation from department as t1 join management as t2 on t1.department_id = t2.department_id join head as t3 on t2.head_id = t3.head_id where t3.born_state = 'alabama'"},
 {'question': 'What are the names of the states where at least 3 heads were born?',
  'context': 'CREATE TABLE head (born_state VARCHAR)',
  'answer': 'SELECT born_state FROM head GROUP BY born_state HAVING COUNT(*) >= 3',
  'normalised': 'select born_state from head group by born_state having count(*) >= 3'},
 {'question': 'In which year were most departments established?',
  'context': 'CREATE TABLE department (creation VARCHAR)',
  'answer': 'SELECT creation FROM department GROUP BY creation ORDER BY COUNT(*) DESC LIMIT 1',
  'normalised': 'select creation from department group by creation order by count(*) desc limit 1'},
 {'question': "Show the name and number of employees for the departments managed by heads whose temporary acting value is 'Yes'?",
  'context': 'CREATE TABLE management (department_id VARCHAR, temporary_acting VARCHAR); CREATE TABLE department (name VARCHAR, num_employees VARCHAR, department_id VARCHAR)',
  'answer': "SELECT T1.name, T1.num_employees FROM department AS T1 JOIN management AS T2 ON T1.department_id = T2.department_id WHERE T2.temporary_acting = 'Yes'",
  'normalised': "select t1.name, t1.num_employees from department as t1 join management as t2 on t1.department_id = t2.department_id where t2.temporary_acting = 'yes'"},
 {'question': 'How many acting statuses are there?',
  'context': 'CREATE TABLE management (temporary_acting VARCHAR)',
  'answer': 'SELECT COUNT(DISTINCT temporary_acting) FROM management',
  'normalised': 'select count(distinct temporary_acting) from management'},
 {'question': 'How many departments are led by heads who are not mentioned?',
  'context': 'CREATE TABLE management (department_id VARCHAR); CREATE TABLE department (department_id VARCHAR)',
  'answer': 'SELECT COUNT(*) FROM department WHERE NOT department_id IN (SELECT department_id FROM management)',
  'normalised': 'select count(*) from department where not department_id in (select department_id from management)'},
 {'question': 'What are the distinct ages of the heads who are acting?',
  'context': 'CREATE TABLE head (age VARCHAR, head_id VARCHAR); CREATE TABLE management (head_id VARCHAR, temporary_acting VARCHAR)',
  'answer': "SELECT DISTINCT T1.age FROM management AS T2 JOIN head AS T1 ON T1.head_id = T2.head_id WHERE T2.temporary_acting = 'Yes'",
  'normalised': "select distinct t1.age from management as t2 join head as t1 on t1.head_id = t2.head_id where t2.temporary_acting = 'yes'"},
 {'question': "List the states where both the secretary of 'Treasury' department and the secretary of 'Homeland Security' were born.",
  'context': 'CREATE TABLE management (department_id VARCHAR, head_id VARCHAR); CREATE TABLE head (born_state VARCHAR, head_id VARCHAR); CREATE TABLE department (department_id VARCHAR, name VARCHAR)',
  'answer': "SELECT T3.born_state FROM department AS T1 JOIN management AS T2 ON T1.department_id = T2.department_id JOIN head AS T3 ON T2.head_id = T3.head_id WHERE T1.name = 'Treasury' INTERSECT SELECT T3.born_state FROM department AS T1 JOIN management AS T2 ON T1.department_id = T2.department_id JOIN head AS T3 ON T2.head_id = T3.head_id WHERE T1.name = 'Homeland Security'",
  'normalised': "select t3.born_state from department as t1 join management as t2 on t1.department_id = t2.department_id join head as t3 on t2.head_id = t3.head_id where t1.name = 'treasury' intersect select t3.born_state from department as t1 join management as t2 on t1.department_id = t2.department_id join head as t3 on t2.head_id = t3.head_id where t1.name = 'homeland security'"},
 {'question': 'Which department has more than 1 head at a time? List the id, name and the number of heads.',
  'context': 'CREATE TABLE management (department_id VARCHAR); CREATE TABLE department (department_id VARCHAR, name VARCHAR)',
  'answer': 'SELECT T1.department_id, T1.name, COUNT(*) FROM management AS T2 JOIN department AS T1 ON T1.department_id = T2.department_id GROUP BY T1.department_id HAVING COUNT(*) > 1',
  'normalised': 'select t1.department_id, t1.name, count(*) from management as t2 join department as t1 on t1.department_id = t2.department_id group by t1.department_id having count(*) > 1'},
 {'question': "Which head's name has the substring 'Ha'? List the id and name.",
  'context': 'CREATE TABLE head (head_id VARCHAR, name VARCHAR)',
  'answer': "SELECT head_id, name FROM head WHERE name LIKE '%Ha%'",
  'normalised': "select head_id, name from head where name like '%ha%'"},
 {'question': 'How many farms are there?',
  'context': 'CREATE TABLE farm (Id VARCHAR)',
  'answer': 'SELECT COUNT(*) FROM farm',
  'normalised': 'select count(*) from farm'},
 {'question': 'List the total number of horses on farms in ascending order.',
  'context': 'CREATE TABLE farm (Total_Horses VARCHAR)',
  'answer': 'SELECT Total_Horses FROM farm ORDER BY Total_Horses',
  'normalised': 'select total_horses from farm order by total_horses'},
 {'question': 'What are the hosts of competitions whose theme is not "Aliens"?',
  'context': 'CREATE TABLE farm_competition (Hosts VARCHAR, Theme VARCHAR)',
  'answer': "SELECT Hosts FROM farm_competition WHERE Theme <> 'Aliens'",
  'normalised': "select hosts from farm_competition where theme <> 'aliens'"},
 {'question': 'What are the themes of farm competitions sorted by year in ascending order?',
  'context': 'CREATE TABLE farm_competition (Theme VARCHAR, YEAR VARCHAR)',
  'answer': 'SELECT Theme FROM farm_competition ORDER BY YEAR',
  'normalised': 'select theme from farm_competition order by year'},
 {'question': 'What is the average number of working horses of farms with more than 5000 total number of horses?',
  'context': 'CREATE TABLE farm (Working_Horses INTEGER, Total_Horses INTEGER)',
  'answer': 'SELECT AVG(Working_Horses) FROM farm WHERE Total_Horses > 5000',
  'normalised': 'select avg(working_horses) from farm where total_horses > 5000'},
 {'question': 'What are the maximum and minimum number of cows across all farms.',
  'context': 'CREATE TABLE farm (Cows INTEGER)',
  'answer': 'SELECT MAX(Cows), MIN(Cows) FROM farm',
  'normalised': 'select max(cows), min(cows) from farm'},
 {'question': 'How many different statuses do cities have?',
  'context': 'CREATE TABLE city (Status VARCHAR)',
  'answer': 'SELECT COUNT(DISTINCT Status) FROM city',
  'normalised': 'select count(distinct status) from city'},
 {'question': 'List official names of cities in descending order of population.',
  'context': 'CREATE TABLE city (Official_Name VARCHAR, Population VARCHAR)',
  'answer': 'SELECT Official_Name FROM city ORDER BY Population DESC',
  'normalised': 'select official_name from city order by population desc'},
 {'question': 'List the official name and status of the city with the largest population.',
  'context': 'CREATE TABLE city (Official_Name VARCHAR, Status VARCHAR, Population VARCHAR)',
  'answer': 'SELECT Official_Name, Status FROM city ORDER BY Population DESC LIMIT 1',
  'normalised': 'select official_name, status from city order by population desc limit 1'},
 {'question': 'Show the years and the official names of the host cities of competitions.',
  'context': 'CREATE TABLE city (Official_Name VARCHAR, City_ID VARCHAR); CREATE TABLE farm_competition (Year VARCHAR, Host_city_ID VARCHAR)',
  'answer': 'SELECT T2.Year, T1.Official_Name FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID = T2.Host_city_ID',
  'normalised': 'select t2.year, t1.official_name from city as t1 join farm_competition as t2 on t1.city_id = t2.host_city_id'},
 {'question': 'Show the official names of the cities that have hosted more than one competition.',
  'context': 'CREATE TABLE farm_competition (Host_city_ID VARCHAR); CREATE TABLE city (Official_Name VARCHAR, City_ID VARCHAR)',
  'answer': 'SELECT T1.Official_Name FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID = T2.Host_city_ID GROUP BY T2.Host_city_ID HAVING COUNT(*) > 1',
  'normalised': 'select t1.official_name from city as t1 join farm_competition as t2 on t1.city_id = t2.host_city_id group by t2.host_city_id having count(*) > 1'},
 {'question': 'Show the status of the city that has hosted the greatest number of competitions.',
  'context': 'CREATE TABLE city (Status VARCHAR, City_ID VARCHAR); CREATE TABLE farm_competition (Host_city_ID VARCHAR)',
  'answer': 'SELECT T1.Status FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID = T2.Host_city_ID GROUP BY T2.Host_city_ID ORDER BY COUNT(*) DESC LIMIT 1',
  'normalised': 'select t1.status from city as t1 join farm_competition as t2 on t1.city_id = t2.host_city_id group by t2.host_city_id order by count(*) desc limit 1'},
 {'question': 'Please show the themes of competitions with host cities having populations larger than 1000.',
  'context': 'CREATE TABLE city (City_ID VARCHAR, Population INTEGER); CREATE TABLE farm_competition (Theme VARCHAR, Host_city_ID VARCHAR)',
  'answer': 'SELECT T2.Theme FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID = T2.Host_city_ID WHERE T1.Population > 1000',
  'normalised': 'select t2.theme from city as t1 join farm_competition as t2 on t1.city_id = t2.host_city_id where t1.population > 1000'},
 {'question': 'Please show the different statuses of cities and the average population of cities with each status.',
  'context': 'CREATE TABLE city (Status VARCHAR, Population INTEGER)',
  'answer': 'SELECT Status, AVG(Population) FROM city GROUP BY Status',
  'normalised': 'select status, avg(population) from city group by status'},
 {'question': 'Please show the different statuses, ordered by the number of cities that have each.',
  'context': 'CREATE TABLE city (Status VARCHAR)',
  'answer': 'SELECT Status FROM city GROUP BY Status ORDER BY COUNT(*)',
  'normalised': 'select status from city group by status order by count(*)'},
 {'question': 'List the most common type of Status across cities.',
  'context': 'CREATE TABLE city (Status VARCHAR)',
  'answer': 'SELECT Status FROM city GROUP BY Status ORDER BY COUNT(*) DESC LIMIT 1',
  'normalised': 'select status from city group by status order by count(*) desc limit 1'},
 {'question': 'List the official names of cities that have not held any competition.',
  'context': 'CREATE TABLE farm_competition (Official_Name VARCHAR, City_ID VARCHAR, Host_city_ID VARCHAR); CREATE TABLE city (Official_Name VARCHAR, City_ID VARCHAR, Host_city_ID VARCHAR)',
  'answer': 'SELECT Official_Name FROM city WHERE NOT City_ID IN (SELECT Host_city_ID FROM farm_competition)',
  'normalised': 'select official_name from city where not city_id in (select host_city_id from farm_competition)'},
 {'question': 'Show the status shared by cities with population bigger than 1500 and smaller than 500.',
  'context': 'CREATE TABLE city (Status VARCHAR, Population INTEGER)',
  'answer': 'SELECT Status FROM city WHERE Population > 1500 INTERSECT SELECT Status FROM city WHERE Population < 500',
  'normalised': 'select status from city where population > 1500 intersect select status from city where population < 500'},
 {'question': 'Find the official names of cities with population bigger than 1500 or smaller than 500.',
  'context': 'CREATE TABLE city (Official_Name VARCHAR, Population VARCHAR)',
  'answer': 'SELECT Official_Name FROM city WHERE Population > 1500 OR Population < 500',
  'normalised': 'select official_name from city where population > 1500 or population < 500'},
 {'question': 'Show the census ranking of cities whose status are not "Village".',
  'context': 'CREATE TABLE city (Census_Ranking VARCHAR, Status VARCHAR)',
  'answer': 'SELECT Census_Ranking FROM city WHERE Status <> "Village"',
  'normalised': 'select census_ranking from city where status <> "village"'},
 {'question': 'which course has most number of registered students?',
  'context': 'CREATE TABLE courses (course_name VARCHAR, course_id VARCHAR); CREATE TABLE student_course_registrations (course_Id VARCHAR)',
  'answer': 'SELECT T1.course_name FROM courses AS T1 JOIN student_course_registrations AS T2 ON T1.course_id = T2.course_Id GROUP BY T1.course_id ORDER BY COUNT(*) DESC LIMIT 1',
  'normalised': 'select t1.course_name from courses as t1 join student_course_registrations as t2 on t1.course_id = t2.course_id group by t1.course_id order by count(*) desc limit 1'},
 {'question': 'what is id of students who registered some courses but the least number of courses in these students?',
  'context': 'CREATE TABLE student_course_registrations (student_id VARCHAR)',
  'answer': 'SELECT student_id FROM student_course_registrations GROUP BY student_id ORDER BY COUNT(*) LIMIT 1',
  'normalised': 'select student_id from student_course_registrations group by student_id order by count(*) limit 1'},
 {'question': 'what are the first name and last name of all candidates?',
  'context': 'CREATE TABLE candidates (candidate_id VARCHAR); CREATE TABLE people (first_name VARCHAR, last_name VARCHAR, person_id VARCHAR)',
  'answer': 'SELECT T2.first_name, T2.last_name FROM candidates AS T1 JOIN people AS T2 ON T1.candidate_id = T2.person_id',
  'normalised': 'select t2.first_name, t2.last_name from candidates as t1 join people as t2 on t1.candidate_id = t2.person_id'},
 {'question': 'List the id of students who never attends courses?',
  'context': 'CREATE TABLE student_course_attendance (student_id VARCHAR); CREATE TABLE students (student_id VARCHAR)',
  'answer': 'SELECT student_id FROM students WHERE NOT student_id IN (SELECT student_id FROM student_course_attendance)',
  'normalised': 'select student_id from students where not student_id in (select student_id from student_course_attendance)'},
 {'question': 'List the id of students who attended some courses?',
  'context': 'CREATE TABLE student_course_attendance (student_id VARCHAR)',
  'answer': 'SELECT student_id FROM student_course_attendance',
  'normalised': 'select student_id from student_course_attendance'},
 {'question': 'What are the ids of all students for courses and what are the names of those courses?',
  'context': 'CREATE TABLE courses (course_name VARCHAR, course_id VARCHAR); CREATE TABLE student_course_registrations (student_id VARCHAR, course_id VARCHAR)',
  'answer': 'SELECT T1.student_id, T2.course_name FROM student_course_registrations AS T1 JOIN courses AS T2 ON T1.course_id = T2.course_id',
  'normalised': 'select t1.student_id, t2.course_name from student_course_registrations as t1 join courses as t2 on t1.course_id = t2.course_id'},
 {'question': 'What is detail of the student who most recently registered course?',
  'context': 'CREATE TABLE student_course_registrations (student_id VARCHAR, registration_date VARCHAR); CREATE TABLE students (student_details VARCHAR, student_id VARCHAR)',
  'answer': 'SELECT T2.student_details FROM student_course_registrations AS T1 JOIN students AS T2 ON T1.student_id = T2.student_id ORDER BY T1.registration_date DESC LIMIT 1',
  'normalised': 'select t2.student_details from student_course_registrations as t1 join students as t2 on t1.student_id = t2.student_id order by t1.registration_date desc limit 1'},
 {'question': 'How many students attend course English?',
  'context': 'CREATE TABLE student_course_attendance (course_id VARCHAR); CREATE TABLE courses (course_id VARCHAR, course_name VARCHAR)',
  'answer': 'SELECT COUNT(*) FROM courses AS T1 JOIN student_course_attendance AS T2 ON T1.course_id = T2.course_id WHERE T1.course_name = "English"',
  'normalised': 'select count(*) from courses as t1 join student_course_attendance as t2 on t1.course_id = t2.course_id where t1.course_name = "english"'},
 {'question': 'How many courses do the student whose id is 171 attend?',
  'context': 'CREATE TABLE courses (course_id VARCHAR); CREATE TABLE student_course_attendance (course_id VARCHAR, student_id VARCHAR)',
  'answer': 'SELECT COUNT(*) FROM courses AS T1 JOIN student_course_attendance AS T2 ON T1.course_id = T2.course_id WHERE T2.student_id = 171',
  'normalised': 'select count(*) from courses as t1 join student_course_attendance as t2 on t1.course_id = t2.course_id where t2.student_id = 171'},
 {'question': 'Find id of the candidate whose email is stanley.monahan@example.org?',
  'context': 'CREATE TABLE candidates (candidate_id VARCHAR); CREATE TABLE people (person_id VARCHAR, email_address VARCHAR)',
  'answer': 'SELECT T2.candidate_id FROM people AS T1 JOIN candidates AS T2 ON T1.person_id = T2.candidate_id WHERE T1.email_address = "stanley.monahan@example.org"',
  'normalised': 'select t2.candidate_id from people as t1 join candidates as t2 on t1.person_id = t2.candidate_id where t1.email_address = "stanley.monahan@example.org"'},
 {'question': 'Find id of the candidate who most recently accessed the course?',
  'context': 'CREATE TABLE candidate_assessments (candidate_id VARCHAR, assessment_date VARCHAR)',
  'answer': 'SELECT candidate_id FROM candidate_assessments ORDER BY assessment_date DESC LIMIT 1',
  'normalised': 'select candidate_id from candidate_assessments order by assessment_date desc limit 1'},
 {'question': 'What is detail of the student who registered the most number of courses?',
  'context': 'CREATE TABLE students (student_details VARCHAR, student_id VARCHAR); CREATE TABLE student_course_registrations (student_id VARCHAR)',

In [9]:


# Step 2 and 3: Iterate over each object in the second JSON file, 
# extract the "query" attribute, and find the matching object in the first JSON file
new_list = []
for spiderItem in spiderDataPoints:
    spiderItemNormalised = spiderItem.get("normalised")
    spiderQuestion = spiderItem.get("question")
    # print(query2)
    foundQuery2 = False
    for createContextItem in sqlCreateContextPoints:
        createContextItemNormalised = createContextItem.get("normalised")
        createContextQuestion = createContextItem.get("question")
        # print(answer1)
        if (spiderItemNormalised == createContextItemNormalised or spiderQuestion == createContextQuestion):
            createContextItem["db_id"] = spiderItem["db_id"]
            createContextItem["question"] = spiderItem["question"]
            createContextItem["answer"] = spiderItem["query"]

            print(createContextItem["db_id"])
            new_list.append(createContextItem)
            sqlCreateContextPoints.remove(createContextItem) 
            foundQuery2 = True
            break
    if not foundQuery2:
        print("Could not find a match for: " + spiderItemNormalised + " " + spiderQuestion)

concert_singer
concert_singer
concert_singer
concert_singer
concert_singer
concert_singer
concert_singer
concert_singer
concert_singer
concert_singer
concert_singer
concert_singer
concert_singer
concert_singer
concert_singer
concert_singer
concert_singer
concert_singer
concert_singer
concert_singer
concert_singer
concert_singer
concert_singer
concert_singer
concert_singer
concert_singer
concert_singer
concert_singer
concert_singer
Could not find a match for: select name from stadium where stadium_id not in (select stadium_id from concert) What are the names of the stadiums without any concerts?
concert_singer
concert_singer
concert_singer
concert_singer
concert_singer
concert_singer
concert_singer
concert_singer
concert_singer
concert_singer
concert_singer
concert_singer
concert_singer
concert_singer
concert_singer
pets_1
pets_1
pets_1
pets_1
pets_1
pets_1
pets_1
pets_1
pets_1
pets_1
pets_1
pets_1
pets_1
pets_1
pets_1
pets_1
pets_1
Could not find a match for: select major, age from student where stuid not in (select t1.stuid from student as t1 join has_pet as t2 on t1.stuid = t2.stuid join pets as t3 on t3.petid = t2.petid where t3.pettype = 'cat') What major is every student who does not own a cat as a pet, and also how old are they?
pets_1
pets_1
pets_1
Could not find a match for: select t1.fname, t1.age from student as t1 join has_pet as t2 on t1.stuid = t2.stuid join pets as t3 on t3.petid = t2.petid where t3.pettype = 'dog' and t1.stuid not in (select t1.stuid from student as t1 join has_pet as t2 on t1.stuid = t2.stuid join pets as t3 on t3.petid = t2.petid where t3.pettype = 'cat') What is the first name of every student who has a dog but does not have a cat?
pets_1
pets_1
pets_1
pets_1
pets_1
pets_1
pets_1
pets_1
pets_1
pets_1
pets_1
pets_1
pets_1
pets_1
pets_1
pets_1
pets_1
pets_1
pets_1
Could not find a match for: select avg(age) from student where stuid not in (select stuid from has_pet) What is the average age for all students who do not own any pets ?
car_1
Could not find a match for: select count(*) from continents; What is the number of continents?
car_1
Could not find a match for: select t1.contid, t1.continent, count(*) from continents as t1 join countries as t2 on t1.contid = t2.continent group by t1.contid; For each continent, list its id, name, and how many countries it has?
car_1
Could not find a match for: select count(*) from countries; How many countries exist?
car_1
Could not find a match for: select t1.fullname, t1.id, count(*) from car_makers as t1 join model_list as t2 on t1.id = t2.maker group by t1.id; What is the full name of each car maker, along with its id and how many models it produces?
car_1
Could not find a match for: select t1.model from car_names as t1 join cars_data as t2 on t1.makeid = t2.id order by t2.horsepower asc limit 1; What is the model of the car with the smallest amount of horsepower?
car_1
car_1
car_1
Could not find a match for: select distinct t1.maker from car_makers as t1 join model_list as t2 on t1.id = t2.maker join car_names as t3 on t2.model = t3.model join cars_data as t4 on t3.makeid = t4.id where t4.year = '1970'; What is the name of the different car makers who produced a car in 1970?
car_1
Could not find a match for: select t2.make, t1.year from cars_data as t1 join car_names as t2 on t1.id = t2.makeid where t1.year = (select min(year) from cars_data); What is the maker of the carr produced in the earliest year and what year was it?
car_1
Could not find a match for: select distinct t1.model from model_list as t1 join car_names as t2 on t1.model = t2.model join cars_data as t3 on t2.makeid = t3.id where t3.year > 1980; What are the different models for the cards produced after 1980?
car_1
Could not find a match for: select t1.continent, count(*) from continents as t1 join countries as t2 on t1.contid = t2.continent join car_makers as t3 on t2.countryid = t3.country group by t1.continent; What is the name of each continent and how many car makers are there in each one?
car_1
Could not find a match for: select t2.countryname from car_makers as t1 join countries as t2 on t1.country = t2.countryid group by t1.country order by count(*) desc limit 1; What is the name of the country with the most car makers?
car_1
car_1
car_1
Could not find a match for: select t1.accelerate from cars_data as t1 join car_names as t2 on t1.id = t2.makeid where t2.make = 'amc hornet sportabout (sw)'; How much does the car accelerate that makes amc hornet sportabout (sw)?
car_1
Could not find a match for: select count(*) from car_makers as t1 join countries as t2 on t1.country = t2.countryid where t2.countryname = 'france'; What is the number of makers of care in France?
car_1
Could not find a match for: select count(*) from model_list as t1 join car_makers as t2 on t1.maker = t2.id join countries as t3 on t2.country = t3.countryid where t3.countryname = 'usa'; What is the count of the car models produced in the United States?
car_1
Could not find a match for: select avg(mpg) from cars_data where cylinders = 4; What is the average miles per gallon of all the cards with 4 cylinders?
car_1
car_1
car_1
Could not find a match for: select maker, model from model_list; What are the makers and models?
car_1
Could not find a match for: select t1.countryname, t1.countryid from countries as t1 join car_makers as t2 on t1.countryid = t2.country group by t1.countryid having count(*) >= 1; What are the names and ids of all countries with at least one car maker?
car_1
Could not find a match for: select count(*) from cars_data where horsepower > 150; What is the number of cars with a horsepower greater than 150?
car_1
Could not find a match for: select avg(weight), year from cars_data group by year; What is the average weight and year for each year?
car_1
Could not find a match for: select t1.countryname from countries as t1 join continents as t2 on t1.continent = t2.contid join car_makers as t3 on t1.countryid = t3.country where t2.continent = 'europe' group by t1.countryname having count(*) >= 3; What are the names of all European countries with at least 3 manufacturers?
car_1
Could not find a match for: select t2.horsepower, t1.make from car_names as t1 join cars_data as t2 on t1.makeid = t2.id where t2.cylinders = 3 order by t2.horsepower desc limit 1; What is the largest amount of horsepower for the models with 3 cylinders and what make is it?
car_1
car_1
car_1
car_1
car_1
Could not find a match for: select avg(t2.edispl) from car_names as t1 join cars_data as t2 on t1.makeid = t2.id where t1.model = 'volvo'; What is the average edispl for all volvos?
car_1
Could not find a match for: select max(accelerate), cylinders from cars_data group by cylinders; What is the maximum accelerate for all the different cylinders?
car_1
Could not find a match for: select model from car_names group by model order by count(*) desc limit 1; What model has the most different versions?
car_1
Could not find a match for: select count(*) from cars_data where cylinders > 4; What is the number of cars with more than 4 cylinders?
car_1
Could not find a match for: select count(*) from cars_data where year = 1980; In 1980, how many cars were made?
car_1
Could not find a match for: select count(*) from car_makers as t1 join model_list as t2 on t1.id = t2.maker where t1.fullname = 'american motor company'; What is the number of car models created by the car maker American Motor Company?
car_1
Could not find a match for: select t1.fullname, t1.id from car_makers as t1 join model_list as t2 on t1.id = t2.maker group by t1.id having count(*) > 3; What are the names and ids of all makers with more than 3 models?
car_1
Could not find a match for: select distinct t2.model from car_names as t1 join model_list as t2 on t1.model = t2.model join car_makers as t3 on t2.maker = t3.id join cars_data as t4 on t1.makeid = t4.id where t3.fullname = 'general motors' or t4.weight > 3500; What are the different models created by either the car maker General Motors or weighed more than 3500?
car_1
Could not find a match for: select distinct year from cars_data where weight between 3000 and 4000; What are the different years in which there were cars produced that weighed less than 4000 and also cars that weighted more than 3000 ?
car_1
Could not find a match for: select t1.horsepower from cars_data as t1 order by t1.accelerate desc limit 1; What is the horsepower of the car with the greatest accelerate?
car_1
Could not find a match for: select t1.cylinders from cars_data as t1 join car_names as t2 on t1.id = t2.makeid where t2.model = 'volvo' order by t1.accelerate asc limit 1; For a volvo model, how many cylinders does the version with least accelerate have?
car_1
Could not find a match for: select count(*) from cars_data where accelerate > (select accelerate from cars_data order by horsepower desc limit 1); What is the number of cars with a greater accelerate than the one with the most horsepower?
car_1
car_1
car_1
Could not find a match for: select count(*) from cars_data where cylinders > 6; What is the number of carsw ith over 6 cylinders?
car_1
Could not find a match for: select t1.model from car_names as t1 join cars_data as t2 on t1.makeid = t2.id where t2.cylinders = 4 order by t2.horsepower desc limit 1; For all of the 4 cylinder cars, which model has the most horsepower?
car_1
car_1
car_1
car_1
car_1
Could not find a match for: select distinct t1.model from model_list as t1 join car_names as t2 on t1.model = t2.model join cars_data as t3 on t2.makeid = t3.id join car_makers as t4 on t1.maker = t4.id where t3.weight < 3500 and t4.fullname != 'ford motor company'; What are the different models wthat are lighter than 3500 but were not built by the Ford Motor Company?
car_1
Could not find a match for: select countryname from countries except select t1.countryname from countries as t1 join car_makers as t2 on t1.countryid = t2.country; What are the names of the countries with no car makers?
car_1
car_1
car_1
car_1
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
flight_2
Could not find a match for: select airportname from airports where airportcode not in (select sourceairport from flights union select destairport from flights) Which airports do not have departing or arriving flights?
employee_hire_evaluation
employee_hire_evaluation
employee_hire_evaluation
employee_hire_evaluation
employee_hire_evaluation
employee_hire_evaluation
employee_hire_evaluation
employee_hire_evaluation
employee_hire_evaluation
employee_hire_evaluation
employee_hire_evaluation
employee_hire_evaluation
employee_hire_evaluation
employee_hire_evaluation
employee_hire_evaluation
employee_hire_evaluation
employee_hire_evaluation
employee_hire_evaluation
employee_hire_evaluation
employee_hire_evaluation
employee_hire_evaluation
employee_hire_evaluation
employee_hire_evaluation
Could not find a match for: select name from employee where employee_id not in (select employee_id from evaluation) What are the names of the employees who never received any evaluation?
employee_hire_evaluation
employee_hire_evaluation
employee_hire_evaluation
Could not find a match for: select name from shop where shop_id not in (select shop_id from hiring) Which shops run with no employees? Find the shop names
employee_hire_evaluation
employee_hire_evaluation
employee_hire_evaluation
employee_hire_evaluation
employee_hire_evaluation
employee_hire_evaluation
employee_hire_evaluation
employee_hire_evaluation
employee_hire_evaluation
employee_hire_evaluation
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
Could not find a match for: select document_id from paragraphs group by document_id order by count(*) asc limit 1 Return the id of the document with the fewest paragraphs.
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
cre_Doc_Template_Mgt
course_teach
course_teach
course_teach
Could not find a match for: select name from teacher order by age asc What are the names of the teachers ordered by ascending age?
course_teach
course_teach
course_teach
Could not find a match for: select name from teacher where hometown != "little lever urban district" What are the names of the teachers whose hometown is not `` Little Lever Urban District '' ?
course_teach
course_teach
course_teach
Could not find a match for: select hometown from teacher order by age asc limit 1 Where is the youngest teacher from?
course_teach
course_teach
course_teach
course_teach
course_teach
course_teach
course_teach
course_teach
course_teach
course_teach
course_teach
course_teach
course_teach
course_teach
course_teach
course_teach
course_teach
Could not find a match for: select name from teacher where teacher_id not in (select teacher_id from course_arrange) What are the names of the teachers whose courses have not been arranged?
museum_visit
museum_visit
museum_visit
museum_visit
museum_visit
museum_visit
museum_visit
museum_visit
museum_visit
museum_visit
museum_visit
museum_visit
museum_visit
museum_visit
museum_visit
museum_visit
museum_visit
museum_visit
wta_1
wta_1
wta_1
wta_1
wta_1
wta_1
wta_1
wta_1
wta_1
wta_1
wta_1
wta_1
wta_1
wta_1
wta_1
wta_1
wta_1
wta_1
wta_1
wta_1
wta_1
wta_1
wta_1
wta_1
wta_1
wta_1
wta_1
wta_1
wta_1
wta_1
wta_1
wta_1
wta_1
wta_1
wta_1
wta_1
wta_1
wta_1
wta_1
wta_1
wta_1
wta_1
wta_1
wta_1
wta_1
wta_1
wta_1
wta_1
wta_1
wta_1
wta_1
wta_1
wta_1
wta_1
wta_1
wta_1
wta_1
wta_1
wta_1
wta_1
wta_1
wta_1
battle_death
battle_death
battle_death
battle_death
battle_death
battle_death
battle_death
battle_death
battle_death
battle_death
battle_death
battle_death
battle_death
battle_death
battle_death
battle_death
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
Could not find a match for: select semester_name from semesters where semester_id not in(select semester_id from student_enrolment) What is the name of the semester with no students enrolled?
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
Could not find a match for: select first_name, middle_name, last_name from students order by date_first_registered asc limit 1 What is the first, middle, and last name of the first student to register?
student_transcripts_tracking
Could not find a match for: select first_name, middle_name, last_name from students order by date_left asc limit 1 What is the first, middle, and last name of the earliest school graduate?
student_transcripts_tracking
Could not find a match for: select first_name from students where current_address_id != permanent_address_id What is the first name of the student whose permanent address is different from his or her current one?
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
Could not find a match for: select transcript_date, other_details from transcripts order by transcript_date asc limit 1 What is the earliest date of a transcript release, and what details can you tell me?
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
Could not find a match for: select t2.transcript_date, t1.transcript_id from transcript_contents as t1 join transcripts as t2 on t1.transcript_id = t2.transcript_id group by t1.transcript_id order by count(*) asc limit 1 What is the date and id of the transcript with the least number of results?
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
student_transcripts_tracking
tvshow
tvshow
tvshow
Could not find a match for: select title from cartoon where directed_by = "ben jones"; What are the names of all cartoons directed by Ben Jones?
tvshow
Could not find a match for: select count(*) from cartoon where written_by = "joseph kuhr"; What is the number of cartoones written by Joseph Kuhr?
tvshow
tvshow
tvshow
Could not find a match for: select title from cartoon where directed_by = "ben jones" or directed_by = "brandon vietti"; What are the titles of all cartoons directed by Ben Jones or Brandon Vietti?
tvshow
Could not find a match for: select country, count(*) from tv_channel group by country order by count(*) desc limit 1; What is the country with the most number of TV Channels and how many does it have?
tvshow

In [10]:
print(len(new_list))
print(len(spiderDataPoints))

936
1034

In [11]:
def remove_normalised_property(obj_list):
    for obj in obj_list:
        if "normalised" in obj:
            del obj["normalised"]
    return obj_list

In [12]:
result_list = remove_normalised_property(new_list)
print(result_list[0])

{'question': 'What is the count of singers?', 'context': 'CREATE TABLE singer (Id VARCHAR)', 'answer': 'SELECT count(*) FROM singer', 'db_id': 'singer'}

In [13]:
print(len(new_list))
print(len(spiderDataPoints))

936
1034

In [14]:
# Step 4: Save the new list to a new JSON file
with open('spider_create_context_val_db_id.json', 'w') as f:
    json.dump(result_list, f, indent=4)

In [64]:
from datasets import load_dataset
import json
import os

# Load the dataset from Hugging Face
dataset = load_dataset('lamini/spider_text_to_sql')

# Create a directory to store the JSON files
os.makedirs('lamini', exist_ok=True)

# Convert the dataset splits to lists of dictionaries
train_data = [dict(item) for item in dataset['train']]
validation_data = [dict(item) for item in dataset['validation']]

# Write the train split to a JSON file
with open('lamini/train.json', 'w') as train_file:
    json.dump(train_data, train_file, ensure_ascii=False, indent=4)

# Write the validation split to a JSON file
with open('lamini/validation.json', 'w') as validation_file:
    json.dump(validation_data, validation_file, ensure_ascii=False, indent=4)

print("Dataset has been downloaded and saved to 'lamini' directory.")

Dataset has been downloaded and saved to 'lamini' directory.